Repository: juntook/Mothball
Catalog: App/Localizable.xcstrings
Source language: en
Languages: zh_hans

# active.devPortsOnly
source: Development ports only
zh_hans: 仅开发端口

# active.tab.containers %lld
source: Containers (%lld)
zh_hans: 容器 %lld

# active.tab.ports %lld
source: Ports (%lld)
zh_hans: 端口 %lld

# active.tab.processes %lld
source: Processes (%lld)
zh_hans: 进程 %lld

# active.tab.services %lld
source: Services (%lld)
zh_hans: 后台服务 %lld

# ai.doctor
source: Verify in Doctor
zh_hans: 在 Doctor 中核实

# ai.doctor.help
source: AI tool layouts change quickly — verify rule targets against this machine.
zh_hans: AI 工具的目录布局变化很快——用 Doctor 在本机核实规则目标。

# ai.empty.description
source: Run a scan to find caches, session history, and models left behind by AI coding tools.
zh_hans: 运行扫描以发现 AI 编程工具留下的缓存、会话历史与模型。

# ai.empty.title
source: No AI tool resources found
zh_hans: 未发现 AI 工具资源

# ai.section.caches
source: Caches
zh_hans: 缓存

# ai.section.data
source: Sessions & data
zh_hans: 会话与数据

# ai.section.protected
source: Protected
zh_hans: 受保护

# ai.summary %@ %lld
source: %1$@ across %2$lld AI tools
zh_hans: 共 %1$@ · %2$lld 个 AI 工具

# badge.unverified
source: Unverified
zh_hans: 未验证

# badge.unverified.help
source: This rule's paths come from public documentation and have not been verified on a real machine yet. Verify via the Doctor panel.
zh_hans: 该规则的路径来自公开资料,尚未在真机核实。可通过 Doctor 面板核实。

# brew.action.start
source: Start
zh_hans: 启动

# brew.action.stopDisable
source: Stop & Disable Autostart
zh_hans: 停止并禁用自启

# brew.action.stopOnce
source: Stop Once
zh_hans: 停止一次

# brew.empty.message
source: No services are registered with brew services.
zh_hans: brew services 中没有注册任何服务。

# brew.empty.title
source: No Homebrew services
zh_hans: 没有 Homebrew 服务

# brew.error.title
source: Service operation failed
zh_hans: 服务操作失败

# brew.exitCode %lld
source: exit code %lld
zh_hans: 退出码 %lld

# brew.footer
source: Stop keeps the login registration; Stop & Disable removes it. Data directories are never touched.
zh_hans: 「停止一次」保留登录自启注册;「停止并禁用自启」会取消注册。数据目录永远不会被动到。

# brew.loadError.hint
source: Try updating Homebrew (brew update) and refresh. Nothing on your system was changed.
zh_hans: 可尝试更新 Homebrew(brew update)后重试。系统没有任何改动。

# brew.loadError.title
source: Couldn't read Homebrew services
zh_hans: 无法读取 Homebrew 服务

# brew.notInstalled.message
source: Background services managed by Homebrew appear here once brew is installed.
zh_hans: 安装 Homebrew 后,这里会显示它管理的后台服务。

# brew.notInstalled.title
source: Homebrew not installed
zh_hans: 未安装 Homebrew

# brew.protected.help
source: Protected by your rules — excluded from batch operations.
zh_hans: 已被你的规则保护,不会进入批量操作。

# brew.startsAtLogin
source: Starts at login
zh_hans: 登录时自启

# brew.status.error
source: Error
zh_hans: 错误

# brew.status.running
source: Running
zh_hans: 运行中

# brew.status.stopped
source: Stopped
zh_hans: 已停止

# cleanup.cancel
source: Cancel
zh_hans: 取消

# cleanup.confirm
source: Clean Up
zh_hans: 开始清理

# cleanup.directDelete.confirm.button
source: Delete Permanently
zh_hans: 永久删除

# cleanup.directDelete.confirm.message
source: Direct delete removes regenerable items without moving them to the Trash. This is asked once per session.
zh_hans: 直接删除不经过废纸篓移除可再生条目。每次会话仅询问一次。

# cleanup.directDelete.confirm.title
source: Delete permanently?
zh_hans: 永久删除?

# cleanup.done
source: Done
zh_hans: 完成

# cleanup.method.delete
source: Direct delete is enabled: regenerable items are removed permanently. User data still goes to the Trash.
zh_hans: 已开启直接删除:可再生条目将被永久删除;用户数据仍会进入废纸篓。

# cleanup.method.trash
source: Items will be moved to the Trash and can be restored from there.
zh_hans: 条目将移入废纸篓,可从废纸篓恢复。

# cleanup.outcome.deleted
source: Deleted
zh_hans: 已删除

# cleanup.outcome.rejected
source: Blocked by the safety gate
zh_hans: 被安全闸门拦截

# cleanup.outcome.skipped
source: Skipped after the run stopped
zh_hans: 清理中止后跳过

# cleanup.outcome.trashed
source: Moved to Trash
zh_hans: 已移入废纸篓

# cleanup.preview.total %lld %@
source: %lld items · %@
zh_hans: %lld 项 · %@

# cleanup.result.apfsNote
source: macOS local snapshots may keep deleted data for a while — the free space shown in Finder updates after snapshots expire, usually within 24 hours.
zh_hans: macOS 本地快照可能暂时保留已删除数据,Finder 显示的可用空间会在快照过期后(通常 24 小时内)更新。

# cleanup.result.reclaimed %@
source: Reclaimed %@
zh_hans: 已释放 %@

# cleanup.result.trashFailure
source: Moving user data to the Trash failed (for example across volumes), so the run stopped. Nothing was deleted directly. Review the remaining items and try again.
zh_hans: 用户数据移入废纸篓失败(例如跨卷),清理已中止;没有任何内容被直接删除。请检查剩余条目后重试。

# cleanup.running
source: Cleaning up…
zh_hans: 正在清理…

# cleanup.section.regenerable
source: Regenerable
zh_hans: 可再生

# cleanup.section.userData
source: User data — confirm each item
zh_hans: 用户数据——需逐项确认

# cleanup.userData.footer
source: These are your own records and cannot be recovered after deletion. They are moved to the Trash only. Check each item to confirm.
zh_hans: 这些是你自己的记录,删除后无法找回;只会移入废纸篓。请逐项勾选确认。

# dashboard.attention.dockerDown
source: Docker daemon isn't running
zh_hans: Docker 守护未运行

# dashboard.attention.dockerDown.detail
source: Container resources can't be listed until it starts.
zh_hans: 守护启动后才能列出容器资源。

# dashboard.attention.empty
source: Nothing needs attention right now.
zh_hans: 当前没有需要关注的项。

# dashboard.attention.highCPU %@
source: Sustained high CPU · %@
zh_hans: 持续高 CPU · %@

# dashboard.attention.longRunning %@ %@
source: Running since %@ · port %@
zh_hans: 已运行至 %@ 起 · 端口 %@

# dashboard.attention.notScanned
source: Run a scan to see what needs attention.
zh_hans: 扫描后这里会显示需要关注的项。

# dashboard.attention.reclaimable %@
source: %@ reclaimable
zh_hans: 可释放 %@

# dashboard.attention.review
source: Review
zh_hans: 查看

# dashboard.attention.staleProject %@ %@
source: Last active %@ · %@ reclaimable
zh_hans: 最后活跃 %@ · 可释放 %@

# dashboard.attention.title
source: Needs Attention
zh_hans: 需要关注

# dashboard.card.memory
source: Dev Memory
zh_hans: 开发内存占用

# dashboard.card.ports
source: Active Ports
zh_hans: 活动端口

# dashboard.card.reclaimable
source: Reclaimable
zh_hans: 可释放空间

# dashboard.card.running
source: Running
zh_hans: 运行中资源

# dashboard.greeting %lld
source: %lld development resources are still running
zh_hans: 你好,今天有 %lld 个开发资源仍在运行

# dashboard.greeting.zero
source: No development resources are running right now
zh_hans: 当前没有发现正在运行的开发资源

# dashboard.lastScan %@
source: Last scan %@ ·
zh_hans: 上次扫描 %@ ·

# dashboard.privacyNote
source: All analysis happens on this Mac; nothing is uploaded.
zh_hans: 所有分析均在本机完成,不上传任何数据。

# dashboard.search.empty
source: No matches across processes, projects, or caches.
zh_hans: 在进程、项目和缓存中都没有找到匹配项。

# dashboard.search.title %@
source: Results for “%@”
zh_hans: 「%@」的搜索结果

# dashboard.session.summary %lld %lld %@
source: %lld processes · %lld containers · %@ memory
zh_hans: %lld 个进程 · %lld 个容器 · 内存 %@

# dashboard.session.title
source: Current Session
zh_hans: 当前开发会话

# dashboard.session.view
source: View Session
zh_hans: 查看会话

# docker.action.prune
source: Prune
zh_hans: 清理

# docker.action.remove
source: Remove
zh_hans: 删除

# docker.action.removeAllDangling %lld
source: Remove all (%lld)
zh_hans: 全部删除(%lld)

# docker.action.removeVolume
source: Delete…
zh_hans: 删除…

# docker.action.stop
source: Stop
zh_hans: 停止

# docker.daemonDown.message
source: Start Docker Desktop, OrbStack or Colima and refresh. This is informational — nothing is wrong.
zh_hans: 启动 Docker Desktop、OrbStack 或 Colima 后点击刷新。这只是提示,并非错误。

# docker.daemonDown.title
source: Docker engine is not running
zh_hans: Docker 引擎未运行

# docker.empty.message
source: Nothing to manage in this view right now.
zh_hans: 当前没有可管理的容器侧资源。

# docker.empty.title
source: No container resources
zh_hans: 没有容器资源

# docker.error.title
source: Docker operation failed
zh_hans: Docker 操作失败

# docker.image.confirm.button
source: Remove Image
zh_hans: 删除镜像

# docker.image.confirm.message %@
source: Getting "%@" back means pulling or rebuilding it.
zh_hans: 找回「%@」需要重新拉取或构建。

# docker.image.confirm.title
source: Remove this image?
zh_hans: 删除此镜像?

# docker.noBinary.message
source: Install Docker Desktop, OrbStack or Colima to manage container resources. Mothball looks in the standard install locations.
zh_hans: 安装 Docker Desktop、OrbStack 或 Colima 后即可管理容器资源。Mothball 会在标准安装位置查找。

# docker.noBinary.title
source: Docker CLI not found
zh_hans: 未找到 Docker CLI

# docker.podman.notice
source: Podman detected — managing Podman resources is not supported yet.
zh_hans: 检测到 Podman——暂不支持管理 Podman 资源。

# docker.section.buildCache
source: Build cache
zh_hans: 构建缓存

# docker.section.dangling
source: Dangling images
zh_hans: 悬空镜像

# docker.section.running
source: Running containers
zh_hans: 运行中的容器

# docker.section.stopped
source: Stopped containers
zh_hans: 已停止的容器

# docker.section.taggedUnused
source: Tagged images with no containers
zh_hans: 无容器引用的镜像

# docker.section.volumes
source: Volumes
zh_hans: 卷

# docker.taggedUnused.footer
source: Re-pulling or rebuilding these costs time and bandwidth, so each removal asks for confirmation.
zh_hans: 重新拉取或构建这些镜像需要时间和带宽,因此每次删除都会单独确认。

# docker.volume.confirm.button %@
source: Delete volume "%@"
zh_hans: 删除卷「%@」

# docker.volume.confirm.message %@
source: Everything stored in "%@" will be lost permanently. This cannot be undone — volumes do not go to the Trash. Make sure nothing you need lives inside.
zh_hans: 「%@」中存储的全部数据将永久丢失,且无法撤销——卷不会进入废纸篓。请确认其中没有你需要的数据。

# docker.volume.confirm.title
source: Delete this volume permanently?
zh_hans: 永久删除此卷?

# docker.volumes.footer
source: Volume contents can hold irreplaceable data (databases!). Volumes are shown for awareness, never join batch cleanup, and deleting one requires a strong confirmation.
zh_hans: 卷内可能存有不可替代的数据(比如数据库)。卷仅作展示,绝不进入批量清理;单独删除需强确认。

# doctor.projectScope %@
source: Project glob: %@ — evaluated per discovered project
zh_hans: 项目内匹配:%@——按已发现项目逐一判定

# doctor.run
source: Re-examine
zh_hans: 重新检测

# doctor.status.missing
source: Not present on this machine
zh_hans: 本机不存在

# doctor.status.ok
source: Exists and readable
zh_hans: 存在且可读

# doctor.status.unreadable
source: Exists but not readable (permissions)
zh_hans: 存在但不可读(权限)

# evidence.bindMount
source: Bind mount source in the project
zh_hans: 绑定挂载源位于项目内

# evidence.composeLabel
source: Attributed via Docker Compose labels
zh_hans: 通过 Compose 标签归属

# evidence.encodedPath
source: Directory name encodes the project path
zh_hans: 目录名编码了项目路径

# evidence.pathInsideProject
source: Located inside the project
zh_hans: 位于项目目录内

# evidence.processCwd
source: Process working directory in the project
zh_hans: 进程工作目录位于项目内

# fda.banner
source: Results may be incomplete: Full Disk Access has not been granted.
zh_hans: 结果可能不完整:未授予完全磁盘访问。

# fda.banner.action
source: Grant…
zh_hans: 去授权…

# fda.banner.relaunch
source: Reopen
zh_hans: 重新打开

# fda.banner.restartHint
source: Granted it already? macOS applies the change to a fresh launch — reopen Mothball. Local rebuilds also need re-granting.
zh_hans: 已经授权了?macOS 需要重新打开应用才会生效;本地重新打包后也需要重新授权一次。

# footer.helpFeedback
source: Help & Feedback
zh_hans: 帮助与反馈

# footer.lastScan %@
source: Last scan %@
zh_hans: 上次扫描 %@

# footer.notScanned
source: Not scanned yet
zh_hans: 尚未扫描

# footer.totalReclaimed.label
source: Reclaimed so far
zh_hans: 累计已释放

# history.empty.description
source: Every stop, cleanup, and container operation is recorded here.
zh_hans: 每一次停止、清理和容器操作都会记录在这里。

# history.empty.title
source: No operations yet
zh_hans: 还没有操作记录

# history.export.errorTitle
source: Export failed
zh_hans: 导出失败

# history.exportDiagnostics
source: Export Diagnostics…
zh_hans: 导出诊断信息…

# history.method.delete
source: Deleted
zh_hans: 直接删除

# history.method.sessionEnd
source: Ended session
zh_hans: 结束会话

# history.method.stop
source: Stopped process
zh_hans: 停止进程

# history.method.trash
source: Moved to Trash
zh_hans: 移到废纸篓

# history.openLog
source: Open Log File
zh_hans: 打开日志文件

# history.openTrash
source: Open Trash
zh_hans: 打开废纸篓

# inspector.children
source: Child processes
zh_hans: 子进程

# inspector.cwd
source: Working directory
zh_hans: 工作目录

# inspector.executable
source: Executable
zh_hans: 可执行文件

# inspector.memory
source: Memory
zh_hans: 内存

# inspector.ports
source: Ports
zh_hans: 端口

# inspector.project
source: Project
zh_hans: 项目

# inspector.running
source: Running
zh_hans: 正在运行

# inspector.stopImpact.body
source: The service stops listening on its ports. Restart it from your project when needed.
zh_hans: 服务将停止监听端口,需要时可在项目中重新启动。

# inspector.stopImpact.title
source: After stopping
zh_hans: 停止后影响

# inspector.uptime
source: Uptime
zh_hans: 运行时长

# kind.artifact
source: Build artifacts
zh_hans: 构建产物

# kind.cache
source: Caches
zh_hans: 缓存

# kind.config
source: Configuration
zh_hans: 配置

# kind.credential
source: Credentials
zh_hans: 凭证

# kind.history
source: History
zh_hans: 历史

# kind.log
source: Logs
zh_hans: 日志

# kind.state
source: State
zh_hans: 状态

# menu.about
source: About Mothball
zh_hans: 关于 Mothball

# menu.checkForUpdates
source: Check for Updates…
zh_hans: 检查更新…

# menu.developer
source: Developer
zh_hans: 开发者

# menu.search
source: Search
zh_hans: 搜索

# menubar.currentSession %@
source: Session: %@
zh_hans: 当前会话:%@

# menubar.endSession
source: End Development Session…
zh_hans: 结束开发会话…

# menubar.findPort
source: Find Port…
zh_hans: 查找端口…

# menubar.openMain
source: Open Mothball
zh_hans: 打开主窗口

# menubar.quit
source: Quit Mothball
zh_hans: 退出 Mothball

# menubar.reclaimable %@
source: Reclaimable %@
zh_hans: 可释放空间 %@

# menubar.scan
source: Scan Reclaimable Space
zh_hans: 扫描可释放空间

# menubar.summary %lld %lld
source: %lld active ports · %lld running resources
zh_hans: %lld 个活动端口 · %lld 个运行资源

# notify.longRunning.body %lld
source: %lld service(s) have been running for over 8 hours.
zh_hans: 有 %lld 个服务已连续运行超过 8 小时。

# notify.longRunning.title
source: Development services still running
zh_hans: 开发服务仍在运行

# notify.space.body %@
source: Mothball found %@ that can be safely reviewed and reclaimed.
zh_hans: Mothball 发现了 %@ 可以查看并安全释放的空间。

# notify.space.title
source: Reclaimable development space
zh_hans: 有可释放的开发空间

# onboarding.back
source: Back
zh_hans: 上一步

# onboarding.continue
source: Continue
zh_hans: 继续

# onboarding.fda.denied
source: Not granted yet. Add Mothball in System Settings, then come back.
zh_hans: 尚未授予。请在系统设置中添加 Mothball,然后返回。

# onboarding.fda.granted
source: Full Disk Access is granted.
zh_hans: 已授予完全磁盘访问。

# onboarding.fda.indeterminate
source: Could not determine status on this machine.
zh_hans: 无法在本机判断授权状态。

# onboarding.fda.open
source: Open System Settings
zh_hans: 打开系统设置

# onboarding.later
source: Set Up Later
zh_hans: 稍后设置

# onboarding.permissions.fda
source: Full Disk Access
zh_hans: 完全磁盘访问

# onboarding.permissions.fda.detail
source: Optional — only for protected development directories
zh_hans: 可选,仅用于受系统保护的开发目录

# onboarding.permissions.fdaNote
source: Full Disk Access is only used to scan the directories you choose. File contents are never uploaded.
zh_hans: 完全磁盘访问只用于扫描你选择的开发目录,不会上传文件内容。

# onboarding.permissions.granted
source: Allowed
zh_hans: 已允许

# onboarding.permissions.intro
source: Mothball only reads what you authorize and analyzes everything locally. Each permission can be granted later.
zh_hans: Mothball 默认只读取你授权的目录,并在本机完成所有分析。每项权限都可以稍后再开启。

# onboarding.permissions.roots
source: Project directories
zh_hans: 项目目录

# onboarding.permissions.roots.choose
source: Choose…
zh_hans: 选择目录…

# onboarding.permissions.roots.count %lld
source: %lld chosen
zh_hans: 已选 %lld 个

# onboarding.permissions.roots.detail
source: Choose the development directories to scan; adjustable anytime
zh_hans: 选择要扫描的开发目录,可随时调整

# onboarding.permissions.runtime
source: Process & port detection
zh_hans: 进程和端口检测

# onboarding.permissions.runtime.detail
source: Processes and listening ports visible to your user
zh_hans: 当前用户可见的进程与监听端口

# onboarding.permissions.title
source: Permissions & Privacy
zh_hans: 权限与隐私

# onboarding.start
source: Get Started
zh_hans: 开始使用

# onboarding.welcome.feature.caches
source: Clean regenerable development caches
zh_hans: 清理可重新生成的开发缓存

# onboarding.welcome.feature.local
source: All analysis happens on this Mac
zh_hans: 所有分析均在本机完成

# onboarding.welcome.feature.ports
source: Find processes holding onto ports
zh_hans: 发现占用端口的进程

# onboarding.welcome.feature.stop
source: Stop containers and local services
zh_hans: 停止容器与本地服务

# onboarding.welcome.privacy
source: Open source (Apache-2.0). Everything runs locally on your Mac; nothing is ever uploaded. Mothball never asks for administrator privileges.
zh_hans: 开源(Apache-2.0)。一切都在你的 Mac 上本地运行,不上传任何数据;永不请求管理员权限。

# onboarding.welcome.tagline
source: Reclaim the disk space your dev tools leave behind — organized by project.
zh_hans: 把开发工具留下的磁盘空间收回来——按项目聚合。

# ports.column.protocol
source: Protocol
zh_hans: 协议

# ports.empty.description
source: No development process is currently listening on a TCP port.
zh_hans: 当前没有开发进程在监听 TCP 端口。

# ports.empty.title
source: No listening ports
zh_hans: 没有监听端口

# projectDetail.clean %@
source: Clean %@
zh_hans: 清理 %@

# projectDetail.lastActive %@
source: Last active %@
zh_hans: 最后活跃 %@

# projects.itemCount %lld
source: %lld items
zh_hans: %lld 项

# projects.noRoots.action
source: Choose Directories…
zh_hans: 选择目录…

# projects.noRoots.description
source: Add your code directories in Settings so Mothball can discover projects and attribute resources to them.
zh_hans: 在「设置」中添加代码目录,Mothball 才能发现项目并把资源归属到项目。

# projects.noRoots.title
source: No code roots configured
zh_hans: 尚未配置代码根目录

# projects.selectedCount %lld
source: %lld selected
zh_hans: 已选 %lld 项

# projects.unattributed
source: Unattributed / Global
zh_hans: 未归属 / 全局

# projects.unattributed.detail
source: Tool data that does not belong to any discovered project
zh_hans: 不属于任何已发现项目的工具数据

# protection.add
source: Add
zh_hans: 添加

# protection.kind.path
source: Exact Path
zh_hans: 精确路径

# protection.kind.pathPrefix
source: Path Prefix
zh_hans: 路径前缀

# protection.kind.port
source: Port
zh_hans: 端口

# protection.kind.processName
source: Process Name
zh_hans: 进程名

# protection.kind.volumeName
source: Docker Volume
zh_hans: Docker 卷

# protection.path.help
source: Protected by your rules — cannot be selected for cleanup.
zh_hans: 已被你的规则保护,无法勾选清理。

# protection.service.help
source: Protected service — excluded from batch stops and sessions.
zh_hans: 受保护的服务,不会进入批量停止或会话结束。

# protection.value.placeholder
source: Value (path, process name, port, or volume)
zh_hans: 值(路径、进程名、端口或卷名)

# protection.volume.help
source: Protected volume — deletion is disabled.
zh_hans: 受保护的数据卷,已禁用删除。

# risk.reason.gitDirty
source: This project has uncommitted changes.
zh_hans: 该项目有未提交的变更。

# risk.reason.noActivitySignals
source: No recent activity, no running process, clean git state.
zh_hans: 无近期活跃、无运行中进程、Git 状态干净。

# risk.reason.projectInUse
source: This project has a running process right now.
zh_hans: 该项目当前有正在运行的进程。

# risk.reason.protectedSafety
source: Protected — display only, never deleted.
zh_hans: 受保护,仅展示,绝不删除。

# risk.reason.recentlyActive
source: This project was active within the last 30 days.
zh_hans: 该项目最近 30 天内活跃过。

# risk.reason.toolCache
source: Global tool cache — likely still in use by the tool.
zh_hans: 全局工具缓存,工具可能仍在使用。

# risk.reason.userData
source: User data — unrecoverable once deleted; trash only.
zh_hans: 用户数据,删除后不可恢复;只会进废纸篓。

# risk.s0
source: Safe
zh_hans: 安全

# risk.s1
source: Low Risk
zh_hans: 低风险

# risk.s2
source: Caution
zh_hans: 谨慎

# risk.s3
source: High Risk
zh_hans: 高风险

# row.ignore
source: Ignore
zh_hans: 忽略

# row.ignored
source: Ignored
zh_hans: 已忽略

# row.protected.help
source: Protected: shown for awareness only. Mothball never deletes this.
zh_hans: 受保护:仅展示占用,Mothball 绝不删除。

# row.revealInFinder
source: Reveal in Finder
zh_hans: 在访达中显示

# row.unignore
source: Stop Ignoring
zh_hans: 取消忽略

# runtime.column.actions
source: Actions
zh_hans: 操作

# runtime.column.memory
source: Memory
zh_hans: 内存

# runtime.column.name
source: Process
zh_hans: 进程

# runtime.column.port
source: Port
zh_hans: 端口

# runtime.column.project
source: Project / Directory
zh_hans: 项目 / 目录

# runtime.column.uptime
source: Started
zh_hans: 启动于

# runtime.empty.description
source: Processes appear here when they listen on a TCP port or run inside one of your projects.
zh_hans: 当进程监听 TCP 端口或运行在你的项目目录中时,会显示在这里。

# runtime.empty.title
source: No running services found
zh_hans: 未发现运行中的服务

# runtime.forceKill.button
source: Force Quit
zh_hans: 强制结束

# runtime.forceKill.message %@ %lld
source: %1$@ (PID %2$lld) is still running 5 seconds after the stop request. Force quitting may lose unsaved work in that process.
zh_hans: %1$@(PID %2$lld)在停止请求 5 秒后仍在运行。强制结束可能丢失该进程未保存的数据。

# runtime.forceKill.title
source: Process did not stop
zh_hans: 进程未停止

# runtime.refresh
source: Refresh
zh_hans: 刷新

# runtime.stale.message
source: That process ID now belongs to a different process, so nothing was signaled. The list has been refreshed.
zh_hans: 该进程 ID 已被其他进程复用,因此未发送任何信号。列表已刷新。

# runtime.stale.title
source: List out of date
zh_hans: 列表已过期

# runtime.stop
source: Stop
zh_hans: 停止

# runtime.stopTree
source: Stop Process Tree
zh_hans: 停止整个进程树

# search.prompt
source: Search ports, processes, or projects
zh_hans: 搜索端口、进程或项目

# sessionEnd.cleanAfter
source: Also review this project's regenerable artifacts
zh_hans: 结束后顺便检查该项目的可再生产物

# sessionEnd.cleanAfter.detail
source: Opens the cleanup preview afterwards — nothing is deleted without confirmation.
zh_hans: 结束后打开清理预览;未经确认不会删除任何内容。

# sessionEnd.estimate %@
source: Frees about %@ of memory
zh_hans: 预计释放 %@ 内存

# sessionEnd.outcome.stillRunning
source: Still running — stop it individually to force quit
zh_hans: 仍在运行,可到进程列表单独强制结束

# sessionEnd.outcome.stopped
source: Stopped
zh_hans: 已停止

# sessionEnd.protected
source: Protected
zh_hans: 已保护

# sessionEnd.result.ok
source: All resources stopped
zh_hans: 全部资源已停止

# sessionEnd.result.partial %lld
source: Done, but %lld item(s) did not stop
zh_hans: 处理完成,但有 %lld 项未成功

# sessionEnd.section.containers %lld
source: Docker containers (%lld)
zh_hans: Docker 容器 %lld

# sessionEnd.section.processes %lld
source: Processes (%lld)
zh_hans: 本地进程 %lld

# sessionEnd.section.protected
source: Kept
zh_hans: 保留

# sessionEnd.stopping %@
source: Stopping %@…
zh_hans: 正在停止 %@…

# sessionEnd.subtitle
source: Resources stop in order and can all be started again. Nothing is deleted.
zh_hans: 将按顺序优雅停止以下资源,全部可重新启动;不会删除任何文件。

# sessionEnd.title %@
source: End the %@ session?
zh_hans: 结束 %@ 开发会话?

# sessions.empty.description
source: When a project has running processes or containers, it appears here as a session you can end in one step.
zh_hans: 当某个项目有正在运行的进程或容器时,会在这里聚合为一个可一键结束的会话。

# sessions.empty.title
source: No active sessions
zh_hans: 当前没有开发会话

# sessions.end
source: End Session
zh_hans: 结束此会话

# sessions.impact %@ %lld
source: Ending frees about %@ of memory · %lld ports
zh_hans: 结束后预计释放 %@ 内存 · %lld 个端口

# sessions.running
source: Running
zh_hans: 运行中

# sessions.saveTemplate
source: Save as Template
zh_hans: 保存为模板

# sessions.section.current
source: Current Sessions
zh_hans: 当前会话

# sessions.section.templates
source: Templates
zh_hans: 会话模板

# sessions.template.apply
source: Apply
zh_hans: 应用

# sessions.template.name.placeholder
source: Name
zh_hans: 名称

# sessions.template.name.title
source: Template name
zh_hans: 模板名称

# sessions.template.noSession.message
source: This project has no running resources right now.
zh_hans: 该项目当前没有正在运行的资源。

# sessions.template.noSession.title
source: No running session
zh_hans: 该项目当前没有会话

# sessions.template.save
source: Save
zh_hans: 保存

# settings.codeRoots.add
source: Add directory…
zh_hans: 添加目录…

# settings.codeRoots.detail
source: Projects are discovered inside these directories (up to 6 levels deep). Rescan after changing.
zh_hans: 在这些目录内发现项目(最深 6 层)。修改后请重新扫描。
